Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: སྨྲས་པ། གསང་བ་པའི་བདག་པོ་གང་ཆོས་གསུང་བའི་དེ་བཞིན་གཤེགས་པ་འཆལ་པར་གསུང་བར་མི་འགྱུར་རམ།
en: “You really should not say, Lord of the Guhyakas, that the Realized One misspeaks when he speaks the Dharma!”

source: སྨྲས་པ། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་ཡི་གེ་གཅིག་ཀྱང་མ་གསུངས་སོ། །མ་བརྗོད་དོ་ཞེས་ཁོ་བོས་སྔར་མ་བཤད་དམ།
en: “Have I not previously explained, Śāntamati, that the Realized One has not articulated or pronounced even a single syllable?

source: དེ་ལྟ་མོད་ཀྱི་སྨོན་ལམ་གྱི་དབང་གིས་དེ་བཞིན་གཤེགས་པའི་གསུང་སེམས་ཅན་རྣམས་ཀྱིས་དམིགས་སོ། །
en: What beings perceive as the Realized One speaking occurs through the force of their own vows and in accordance with their own motivations.”

source: སྨྲས་པ། སྨྲས་ན་ཉེས་པ་ཅི་ཡོད།
en: “What is the fault of one who speaks?”

source: སྨྲས་པ། ངག་གི་ལས་ཀྱི་ཉེས་པར་འགྱུར་རོ། །
en: “One who speaks commits a fault of verbal action.”

source: སྨྲས་པ། ངག་གི་ལས་ལས་ཉེས་པ་ཅི་ཞིག་འབྱུང་། སྨྲས་པ།
en: “What is the fault of one who makes a verbal action?”

source: ཡི་གེ་ལ་སེམས་པས་བཀླགས་པའི་ཉེས་པར་འགྱུར་རོ། །
en: “The fault of uttering words by thinking of syllables.”

source: སྨྲས་པ། ཉེས་པ་མེད་པ་གང་ཡིན།
en: “What, then, is faultless?”

source: སྨྲས་པ། གང་མི་སྨྲ་མི་རྗོད་པ་དེ་ལ་རྣམ་པར་རིག་པ་གང་ཡང་མེད་དོ། །རྣམ་པར་རིག་པ་མེད་པ་ནི་ཉེས་པ་མེད་པའོ། །
en: “What is not spoken, what is not pronounced, is not made known at all, and what is not made known is faultless.

source: གང་བདག་ལ་རྣམ་པར་རིག་པར་མི་བྱེད་པ་དང་། གཞན་ལ་རྣམ་པར་རིག་པར་མི་བྱེད་པ་དེ་ཉེས་པ་མེད་པའོ། །སྨྲས་པ།
en: What is not made known as self or other, that is faultless.”

source: ཉེས་པའི་རྩ་བ་གང་ཡིན། སྨྲས་པ།
en: “What is the root of fault?”

source: ཉེས་པའི་རྩ་བ་ནི་འཛིན་པའོ། །སྨྲས་པ།
en: “The root of fault is grasping.”

source: འཛིན་པའི་རྩ་བ་ཅི་ཡིན། །སྨྲས་པ།
en: “What is the root of grasping?”

source: མངོན་པར་ཞེན་པ་ནི་རྩ་བའོ། །སྨྲས་པ།
en: “Its root is fixation.”

source: མངོན་པར་ཞེན་པའི་རྩ་བ་ཅི་ཡིན། སྨྲས་པ།
en: “What is the root of fixation?”

source: ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པ་ནི་རྩ་བའོ། །སྨྲས་པ།
en: “Its root is false supposition.”

source: ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པའི་རྩ་བ་ཅི་ཡིན། སྨྲས་པ།
en: “What is the root of false supposition?”

source: ལྷག་པར་དམིགས་པའི་ལྟ་བ་ནི་རྩ་བའོ། །སྨྲས་པ།
en: “Its root is a view that takes something as a basis of cognition.”

source: ཅི་ཞིག་ལ་ལྷག་པར་དམིགས། སྨྲས་པ།
en: “What is taken as a basis for cognition?”

source: གཟུགས་རྣམས་དང་། སྒྲ་རྣམས་དང་། དྲི་རྣམས་དང་། རོ་རྣམས་དང་། རེག་བྱ་རྣམས་དང་།
en: “Forms, sounds, smells, tastes, tactile sensations, and mental objects are taken as the bases for cognition.”

source: ཆོས་རྣམས་ལ་ལྷག་པར་དམིགས་སོ། །སྨྲས་པ། ལྷག་པར་མི་དམིགས་པ་ཇི་ལྟ་བུ།
en: “What is not taken as the basis for cognition?”

source: སྨྲས་པ། གལ་ཏེ་སྲིད་པའི་བག་ལ་ཉལ་ལ་ལྷག་པར་མི་དམིགས་པ་སྟེ། ཞི་བའི་བློ་གྲོས་དེ་ལྟ་བས་ན་སྲེད་པ་ལ་དམིགས་པ་སྤང་བའི་ཕྱིར།
en: “The propensity for craving is not taken as a basis for cognition, Śāntamati, because the Dharma that is taught by the Realized One has as its aim the abandonment of craving as a basis for cognition.”

source: དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་ཏོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བསྟན་པ་འདི་བཤད་པ་ན། དགེ་སློང་ལྔ་བརྒྱ་ནི་སེམས་རྣམ་པར་གྲོལ་ལོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉིས་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: While Vajrapāṇi, Lord of the Guhyakas, was giving this teaching, the minds of five hundred monks became liberated and two hundred bodhisattvas acquired an acceptance of the fact that things do not arise.

source: གཉིས་སུ་མེད་པ་བརྗོད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་བདུན་པའོ།། །།
en: This was the seventeenth chapter, “Articulating Nonduality.” Chapter 18: Enjoying a Meal After Going to Aḍagavatī

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་བརྣག་པ་ཡོངས་སུ་རྫོགས་པར་ལུང་བསྟན་པས་དབུགས་ཕྱིན་པ་ཐོབ་སྟེ། ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ནས་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་།
en: Now, Vajrapāṇi, Lord of the Guhyakas, was satisfied, overjoyed, pleased, and glad.

source: ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He felt both delight and cheerfulness of mind at having received the prediction of the fulfillment of his intention.

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་ཐབས་ཅིག །ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་གསང་བ་པ་བདག་གི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གཤེགས་ཤིང་དགུང་བདུན་ཞིག་བཞུགས་པར་ཅི་གནང་། དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ན་གནོད་སྦྱིན་དང་། གྲུལ་བུམ་དང་།
en: So he said to the Blessed One, “Would you please show compassion for me, Blessed One, and come with these bodhisattvas and great disciples to the capital city of Aḍagavatī in my abode of guhyakas and stay there for seven days?

source: སྲིན་པོ་དང་། ཤ་ཟ་དང་། དྲི་ཟ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་མང་དུ་མཆིས་ཏེ། སེམས་ཅན་གྱི་རིགས་རྣམ་པ་སྣ་ཚོགས་གནས་པ་དེ་དག་གིས།
en: The reason, Blessed One, is that there are many different types of beings, such as yakṣas, kumbhāṇḍas, rākṣasas, piśācas, gandharvas, and mahoragas, dwelling in the capital city of Aḍagavatī.

source: བཅོམ་ལྡན་འདས་མཐོང་ཞིང་ཆོས་ཀྱང་ཐོས་ན་ཡུན་རིང་པོའི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། གྲུབ་པ་དང་། བདེ་བར་འགྱུར་ལགས་སོ། །དེས་ན་ཡང་ཁྲོ་བ་དང་སྡང་བའི་སེམས་མ་མཆིས་པར་འགྱུར་ལགས་སོ། །
en: Seeing the Blessed One and hearing the Dharma will be to their benefit, prosperity, bliss, and aims for a long time, and from then on they will abstain from thoughts that are sullied by wickedness and anger.

source: རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གཡོག་འཁོར་གང་ལགས་པ་དེ་དག་གི་ཡུན་རིང་པོའི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། གྲུབ་པ་དང་། བདེ་བར་འགྱུར་ལགས་སོ། །
en: For the Four Great Kings and their assemblies, too, it will be to their benefit, prosperity, bliss, and aims for a long time.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་ཐུགས་བརྩེ་བ་དང་།
en: By remaining silent, the Blessed One gave his consent that he would go to the capital city of Aḍagavatī in the abode of the Lord of the Guhyakas, together with the bodhisattvas and great disciples, and stay there for seven days.

source: སེམས་ཅན་ཚད་མེད་པ་གང་དག་གི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྤེལ་བ་དང་། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་བསམ་པ་ཡོངས་སུ་བཀང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་གསང་བ་པའི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གཤེགས་ཏེ་ཞག་བདུན་བཞུགས་པར་གནང་ངོ་། །
en: He did so out of compassion for Vajrapāṇi, Lord of the Guhyakas, and with the aim to cultivate further the roots of virtue of immeasurable beings and to fulfill the wishes of Vajrapāṇi, Lord of the Guhyakas.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས། བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་མཛད་པ་རིག་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ནས།
en: Knowing that the Blessed One had given his consent by remaining silent, Vajrapāṇi, Lord of the Guhyakas, was satisfied, overjoyed, pleased, and glad.

source: དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: He felt both delight and cheerfulness of mind.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ།
en: He bowed his head at the Blessed One’s feet and walked around him seven times, keeping him on the right.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ག་ལ་བ་དེར་སོང་སྟེ་རང་གི་གནས་སུ་ཕྱིན་ཏོ། །
en: He then took leave of the Blessed One, and having left his presence, he went to the capital city of Aḍagavatī in his own abode.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྙམ་དུ་བསམས་ཏེ། བདག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ཅི་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་ཐམས་ཅད་ངོ་མཚར་དུ་སེམས་པར་འགྱུར་བ་དང་། ཕྱོགས་བཅུ་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་དགའ་བ་སྐྱེ་བར་འགྱུར་བ་དང་། བདག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་འཁོར་གྱི་ཁྱམས་བཀོད་པ་བྱའོ་སྙམ་མོ། །
en: At that point, it occurred to Vajrapāṇi, Lord of the Guhyakas, “I ought to make my courtyard into such an array of adornments that, when I perform the worship of the Realized One, all the gods from the desire and form realms will be awestruck, and the bodhisattvas who gather from the ten directions will feel delighted, and so that the worship I perform for the Realized One will be something grand.”

source: དེས་ཡང་འདི་སྙམ་དུ་བསམས་ཏེ་བདག་གིས་མངོན་པར་ཤེས་ཏེ། དུས་གཅིག་ཅིག་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བཀོད་པའི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ལུང་བསྟན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་མཚན་མོ་མི་ཉལ་ཙམ་ན་སྤྱོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: Then it occurred to him, “I remember one time the Blessed One, while he was resting for the night, entered a state of meditative concentration known as the endowment of inconceivable activity.

source: འཇིག་རྟེན་གྱི་ཁམས་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་ཏེ།
en: He then went in the eastern direction, going past as many buddha domains as there are grains of sand in the Ganges River, to a world named Anantaguṇaratnavyūha, the buddha domain of the blessed realized one Vyūharāja, in order to make predictions for ten thousand bodhisattvas there.

source: འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་མཐའ་ཡས་པ་བཀོད་པ་ཞེས་བྱ་བར་གཤེགས་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདག་གིས་ལྷའི་དང་། མིའི་བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལས་ཡང་དག་པར་འདས་པའི་བཀོད་པ་མཐོང་གིས།
en: In that buddha domain, I saw an inconceivable array that surpassed the arrays made by gods and human beings.

source: བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར། བདག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་མཐའ་ཡས་པ་བཀོད་པ་དེའི་བཀོད་པ་ཅི་འདྲ་བ་དེ་འདྲ་བའི་འཁོར་གྱི་ཁྱམས་བཀོད་པར་བྱའོ་སྙམ་མོ། །
en: For the worship of the Blessed One, I should make my courtyard into an array just like the array in Anantaguṇaratnavyūha.”

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་དེའི་ཚེ་བཀོད་པ་ཆེན་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་བཀོད་པ་ཆེན་པོའི་རྒྱལ་པོའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་མཐའ་ཡས་པ་བཀོད་པ་དེའི་བཀོད་པ་ཅི་འདྲ་བ་དེ་འདྲ་བའི་འཁོར་གྱི་ཁྱམས་བཀོད་པ་ཞིག་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་གྱི་དབུས་ན་གནས་པར་སྣང་ངོ་། །
en: At that very moment, Vajrapāṇi, Lord of the Guhyakas, entered into the state of meditative concentration known as the king of great arrays and just as soon as Vajrapāṇi, Lord of the Guhyakas, had entered into the meditative concentration the king of great arrays, at that very moment the courtyard situated the middle of the capital city of Aḍagavatī appeared as an array that was exactly like the array in Anantaguṇaratnavyūha.

source: འཁོར་གྱི་ཁྱམས་དེ་ཡང་ཡངས་ཤིང་རྒྱ་ཆེ་སྟེ།
en: It was grand and expansive.

source: ཤར་ནུབ་ཏུ་ཆུར་ནི་དཔག་ཚད་དྲུག་ཅུ་རྩ་བཞི་ཡོད་པ། ལྷོ་བྱང་དུ་རྒྱར་ནི་དཔག་ཚད་བཞི་བཅུ་རྩ་གཉིས་ཡོད་པ།
en: It spanned sixty-four leagues from east to west, and from north to south it spanned thirty-two leagues.

source: ས་གཞི་ནི་བཻ་དཱུརྱ་སྔོན་པོའི་རང་བཞིན་དུ་གནས་པ། ཕྱིར་ནི་ཨན་ད་རྙིལ་ལས་བྱས་པ།
en: The surface of the floor was made of the bluest lapis lazuli.

source: ཟུང་གི་ཕྲུགས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ། འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་པད་མས་བརྒྱན་པ།
en: The surrounding walls were made of sapphire, and the twin enclosures were set with all manner of gems, inlaid with lotuses of gold from the Jambu River.

source: རྒྱན་ཕྲེང་སྣ་ཚོགས་དུ་མས་སྤྲས་པ། རས་བཅོས་བུ་དུ་མ་བཏིང་བ། མུ་ཏིག་གི་རྒྱན་ཕྲེང་དུ་མ་སྤྱངས་པ། དར་གྱི་ལྡ་ལྡི་དུ་མས་མཛེས་པར་བྱས་པ།
en: It was decorated with colorful strands, arranged with many heavenly linens, draped with many strands of pearl, and adorned with numerous garlands of silken fillets.

source: མེ་ཏོག་གི་ཕྲེང་བ་དུ་མས་བཀབ་པ། པོག་པོར་དུ་མ་ནས་བདུགས་པ། ལྷའི་མེ་ཏོག་ཁ་དོག་དུ་མ་དང་། ཁ་དོག་སྣ་ཚོགས་བཀྲམ་པ།
en: It was covered with many garlands of flowers, perfumed by many bowls of burning incense, and many heavenly flowers of different colors and blossoms of jewels were scattered throughout it.

source: བཀྲ་བ། བལྟ་ན་སྡུག་པ། ཡིད་དུ་འོང་བ། ལུས་སིམ་པར་བྱེད་པ། སེམས་ལ་དགའ་བ་བསྐྱེད་པ།
en: It was colorful, beautiful to behold, gratifying to the mind, stimulating to the body, and something that brought excitement to one’s thoughts.

source: ཡོན་ཏན་གྱི་ཚོགས་མཐའ་ཡས་པ་དང་ལྡན་པ། བསྔགས་པའི་བསྟན་པ་ཚད་མེད་པ་སྟེ།
en: It was truly an accumulation of endless virtues, a description in praise of which would have no measure.

source: འཁོར་གྱི་ཁྱམས་དེར་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྩ་བས་བརྒྱན་པ།
en: In the courtyard, many hundreds of thousands of lion’s seats spontaneously appeared.

source: རིན་པོ་ཆེའི་ཁ་ཁྱེར་གྱིས་བསྐོར་བ། རིན་པོ་ཆེའི་པད་མ་བཀོད་པ་དང་ལྡན་པ། མུ་ཏིག་གི་དྲ་བས་གཡོགས་པ། མིག་མངས་རིས་སུ་བྲེས་པ། ལྷའི་རས་བཅོས་བུ་དུ་མ་བཏིང་བ།
en: They were studded with jewels, raised upon jeweled daises, arrayed with jeweled lotuses, covered with nets of pearls, divided into squares like a chessboard, arranged upon many heavenly linens, and above them were coverings of nets of jewels.

source: སྟེང་དུ་རིན་པོ་ཆེའི་དྲ་བ་བྲེས་པ། བཀོད་པ་སྔོན་མ་མཐོང་མ་ཐོས་པ། འཇིག་རྟེན་གྱི་ཁམས་མང་པོ་དག་ན་མེད་པ་བརྒྱ་སྟོང་མང་པོ་བྱུང་ངོ་། །ཞལ་ཟས་རོ་བྲོ་བ་བརྒྱས་བསྒོས་པའང་བཤམས་སོ། །
en: They were arrayed in ways previously unseen and unheard of, in ways that do not appear in many worlds, but the arrangement was set forth in such a way as to be appreciated by hundreds of different tastes.

source: སེང་གེའི་ཁྲི་ས་ལ་མི་རྟེན་པ་བརྒྱ་སྟོང་ཡང་བཞག་སྟེ། སེང་གེའི་ཁྲི་རེ་རེའི་བར་སྣང་ལ་ཡང་རིན་པོ་ཆེའི་གདུགས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་དག་བྲེས་སོ། །
en: The hundreds of thousands of lion’s seats were set up so that they were not fixed upon the ground, and in the sky above them each and every lion’s seat was covered by a jeweled parasol endowed with the finest of all qualities.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འཁོར་གྱི་ཁྱམས་བཀོད་པ་དང་། སེང་གེའི་ཁྲི་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་བྱས་ནས་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ།
en: Now, when he had created the array in the courtyard and the array of lion’s seats in that fashion, Vajrapāṇi, Lord of the Guhyakas, mindful and alert, arose from that meditative concentration.

source: དེའི་ནུབ་མོ་ཉིད་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་འོས་པའི་ཞལ་ཟས། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པས་ཡོངས་སུ་དག་པ། རོ་བྲོ་བ་མང་པོ་སྣ་ཚོགས་དང་ལྡན་པ། བསོད་པ་མང་པོ་ཡང་བཤམས་ནས་ནམ་ནངས་པ་དང་།
en: That night, he laid out an abundant and excellent meal, arrayed with many different flavors, made pure by the motivation of a bodhisattva, and worthy of being offered in worship to the Realized One.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སྨྲས་པ། གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །
en: At the end of the night, he said to the Four Great Kings, “Friends, know this!

source: ཁོ་བོས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ། གསང་བ་པ་རང་གི་གནས་སུ་སྤྱན་དྲངས་ན། བཅོམ་ལྡན་འདས་ཀྱིས་ཁོ་བོ་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་གནང་གིས། དེ་ལ་ཁྱེད་དཔུང་དང་བཅས།
en: I have invited the Blessed One to stay in my abode of the guhyakas along with the bodhisattvas of great courage and the great disciples, and he has accepted out of compassion for me.

source: གཡོག་འཁོར་དང་བཅས་པར་མི་གཡེང་བའི་སེམས་ཀྱིས་ཞག་བདུན་གྱི་བར་དུ་ལས་གཞན་མི་བྱེད་པར་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བར་སྤྲོ་བར་གྱིས་ཤིག །ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ན་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། དྲི་ཟ་དང་། གྲུལ་བུམ་དང་། གསང་བ་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཇི་སྙེད་འཁོད་པ་དང་། དེ་མ་ཡིན་པའི་སེམས་ཅན་གཞན་དག་འཁོད་པ་དེ་དག་ལ་ཡང་གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །
en: Therefore, you and your armies and assemblies, worship and serve the Blessed One with enthusiasm for seven days and do not become distracted by any other task.” To the yakṣas, rākṣasas, pretas, piśācas, gandharvas, kumbhāṇḍas, guhyakas, mahoragas, and the other kinds of beings who were residing in the capital city of Aḍagavatī, he said, “Friends, know this!

source: ཁོ་བོས་བཅོམ་ལྡན་འདས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་འདིར་སྤྱན་དྲངས་ན་གཤེགས་པར་གནང་གིས། དེ་ལ་ཁྱེད་ཀྱིས་ངན་སེམས་མེད་པ་དང་།
en: I invited the Blessed One to come to the capital city of Aḍagavatī and he has agreed to come.

source: སྡང་བ་མེད་པ་དང་། དགའ་བ་དང་། དད་པ་དང་། མཆོག་ཏུ་དགའ་བ་མང་པོས་བཅོམ་ལྡན་འདས་དེ་ལ་བསྙེན་བཀུར་གྱིས་ཤིག །ཆོས་ཀྱང་ཉོན་ཅིག་ཅེས་བསྒོའོ།། །།
en: Therefore, do not be malicious, do not be hostile, but worship the Blessed One with a great deal of joy, faith, and the utmost delight, and listen to the Dharma, too.”

source: བམ་པོ་བརྒྱད་པ། དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བུ་ཐུ་བོ་རྡོ་རྗེའི་སྡེ་ཞེས་བྱ་བ་ལ་སྨྲས་པ། བཞིན་བཟངས་ཁྱོད་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སོང་ལ་ཚངས་རིས་ནས་བཟུང་སྟེ། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ལ་བཅོམ་ལྡན་འདས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གདུགས་ཚོད་གསོལ་གྱིས། ཁྱེད་ཀྱི་ནང་ནས་སུ་ལྟ་འདོད་པ་དེ་མྱུར་དུ་ཤོག་ཤིག་ཅེས་སྦྲོན་ཅིག །
en: Vajrapāṇi, Lord of the Guhyakas, then spoke to his eldest son, Vajrasena: “Handsome Face, use your superhuman powers and go to the heavenly realms from the Heaven of Brahmā’s Assembly up to the Supreme Heaven and inform the gods of those realms that the Blessed One has been invited to receive his midday meal in the capital city of Aḍagavatī in the abode of Vajrapāṇi, Lord of the Guhyakas, and that whoever among them wishes to see him should come quickly.

source: ཡབ་དེ་ལྟར་བགྱིའོ་ཞེས་ཏེ་ཇི་སྐད་བསྒོ་བ་བཞིན་དུ་གསང་བ་པའི་བདག་པོའི་བུ་དེས་བྱས་སོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བུ་གཉིས་པ་ལག་བཟངས་ཞེས་བྱ་བ་ལ་སྨྲས་པ། ཁྱོད་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སོང་ལས་བླ་པའི་ལྷ་རྣམས་ནས་བཟུང་སྟེ། བར་སྣང་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་དང་།
en: Do as your father says!” The son of the lord of the guhyakas then did as he was told.

source: སུམ་ཅུ་རྩ་གསུམ་པ་དང་། འཐབ་བྲལ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་རྣམས་ལ་བཅོམ་ལྡན་འདས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གདུགས་ཚོད་གསོལ་གྱིས།
en: Vajrapāṇi, Lord of the Guhyakas, then spoke to his second son, Subāhu: “Use your superhuman powers and go to the heavenly realms from the realms of the earth-dwelling deities and the sky-dwelling deities up to the Heaven of the Four Great Kings, the Heaven of the Thirty-Three, the Yāma Heaven, the Heaven of the Contented, the Heaven of Those Whose Delight Comes from Magical Creations, and the Heaven of Those Who Possess the Power to Transform Others’ Delight into Their Own, and inform the gods of those realms that the Blessed One has been invited to receive his midday meal in the capital city of Aḍagavatī in the abode of Vajrapāṇi, Lord of the Guhyakas, and that whoever among them wishes to see him should come quickly.

source: ཁྱེད་ཀྱི་ནང་ནས་སུ་ལྟ་འདོད་པ་དེ་མྱུར་དུ་ཤོག་ཤིག་ཅེས་སྦྲོན་ཅིག །ཡབ་དེ་ལྟར་བགྱིའོ་ཞེས་ཏེ་ཇི་སྐད་བསྒོ་བ་བཞིན་དུ་གཞོན་ནུ་ལག་བཟངས་ཀྱིས་བྱས་སོ། །
en: Do as your father says!” The young Subāhu then did as he was told.

source: དེ་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་བརྒྱ་སྟོང་དག་གིས། དཔག་ཚད་ཁྲི་ཁོར་ཡུག་གི་བར་སྣང་ཁྱབ་པར་གྱུར་ཏོ། །
en: Then, in an instant, in a fraction of an instant, many hundreds of thousands of gods from the desire and form realms appeared there and pervaded the surrounding area for ten thousand leagues.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ཀྱི་མཆོད་པ་བཤམས་ཏེ་ནམ་ནངས་པ་དང་། པུས་མོ་གཡས་པའི་ལྷ་ངས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གདུགས་ཚོད་བབ་པ་གསོལ་པ། །
en: Vajrapāṇi, Lord of the Guhyakas, then arranged the offerings for the Blessed One, and in the morning he knelt down on his right knee, and, bowing down to the Blessed One with his palms joined together in a gesture of salutation, he informed the Blessed One that the midday meal was ready by reciting the following verses:

source: ཐུབ་པ་ཆེན་པོ་དུས་འདི་ལགས། །
en: “Great sage, the time has come.

source: སྐྱེས་བུ་གཙོ་བོ་གཤེགས་སུ་གསོལ། །
en: Best of men, please come!

source: སྐྱེས་བུ་དམ་པ་གཤེགས་སུ་གསོལ། །
en: True man, please come!

source: སྐྱེས་བུ་ཅང་མཁྱེན་གཤེགས་སུ་གསོལ། །
en: Most noble man, please come!

source: ཐུབ་པ་ཆེན་པོ་གདུགས་ཚོད་བབ། །
en: “Great sage, the midday meal is ready.

source: རྐང་གཉིས་གཙོ་བོ་གཤེགས་སུ་གསོལ། །
en: Best of bipeds, please come!

source: རྐང་གཉིས་དམ་པ་གཤེགས་སུ་གསོལ། །
en: True biped, please come!

source: རྐང་གཉིས་ཅང་མཁྱེན་གཤེགས་སུ་གསོལ། །
en: Most noble biped, please come!

source: ཚུལ་ཁྲིམས་པད་མའི་རྫིང་ནས་འཁྲུངས། །
en: “Like a lotus born in the pond of moral conduct,

source: བརྩོན་འགྲུས་ཆབ་ཀྱིས་རྣམ་པར་འཕེལ། །
en: You flourished in the water of heroic effort,

source: སློབ་མ་བུང་བ་སྒྲ་འབྱིན་པ། །
en: And now students buzz around you like bees.

source: ཐུབ་པ་པད་མ་གཤེགས་སུ་གསོལ། །
en: Lotus-like sage, please come!

source: འཕགས་པའི་བདེན་པར་གནས་བཅས་ཏེ། །
en: “You dwell among the truths of the noble ones,

source: བྱམས་དང་ཐུགས་རྗེའི་སྤྱན་མངའ་ཞིང་། །
en: You have the eyes of love and compassion,

source: བདག་མེད་པ་ཡི་སྒྲ་སྒྲོགས་པ། །
en: And you utter the roar of no self.

source: རྒྱལ་བ་སེང་གེ་གཤེགས་སུ་གསོལ། །
en: Victorious lion, please come!

source: ཁྲིམས་ནི་རྩ་བ་ཆུ་བ་དྲན། །
en: “The core of your conduct has mindfulness as its roots.

source: བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་བརྒྱན། །
en: Your flowering branches are the limbs of awakening.

source: རྣམ་གྲོལ་འབྲས་བུ་ཕུན་སུམ་ཚོགས། །
en: Your fruits of liberation are your attainments.

source: རྒྱལ་བ་སྡོང་པོ་གཤེགས་སུ་གསོལ། །
en: Victorious tree, please come!

source: ཤེས་རབ་རྒྱ་ཆེན་ཟབ་པ་པོ། །
en: “Your depths have the vastness of wisdom.

source: ཏིང་འཛིན་ཆབ་ནི་གྲང་ལྡན་ཞིང་། །
en: Your waters have the coolness of concentration.

source: རྣལ་འབྱོར་པ་ཡི་ཚོང་པས་གཏམ། །ཡོན་ཏན་རྒྱ་མཚོ་གཤེགས་སུ་གསོལ། །
en: Sea traders speak of you as one immersed in yoga. Ocean of virtues, please come!

source: ཐུགས་རྗེའི་དཀྱིལ་འཁོར་དཔལ་ལྡན་པ། །
en: “Glorious sphere of compassion,

source: ཤེས་རབ་འོད་ཟེར་ལེགས་པར་བརྒྱན། །
en: Radiating light rays of wisdom,

source: སློབ་མ་པད་མ་ཁ་འབྱེད་པ། །
en: Making students bloom like flowers,

source: ཐུབ་པ་ཉི་མ་གཤེགས་སུ་གསོལ། །
en: You are the sun, sage—please come!

source: ཕས་ཀྱི་རྒོལ་བས་མི་བསྐྱོད་ཅིང་། །
en: “You are unmoved by proponents of other doctrines.

source: རྣམ་ཐར་ལ་སོགས་སྨན་ཚོགས་ཅན། །
en: You bear the medicines of freedom and the like.

source: སློབ་དང་མི་སློབ་རི་དགས་གཏམ། །
en: Students and those beyond schooling are said to be deer.

source: ཐུབ་པ་རི་བོ་གཤེགས་སུ་གསོལ། །
en: You are a mountain, sage—please come!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་གདུགས་ཚོད་ཕབ་པར་མཁྱེན་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་གསང་བ་པའི་བདག་པོས་གདུགས་ཚོད་ཕབ་ཀྱིས་ཆོས་གོས་གྱོན་ལ་ལྷུང་བཟེད་ཐོགས་ཤིག །ཞག་བདུན་བྱིན་གྱིས་བརླབ་པ་བྱིན་གྱིས་རློབས་ལ་གཙུག་ལག་ཁང་སྐྱོང་སྐོས་ཤིག །དེ་ནས་ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་རྫུ་འཕྲུལ་དང་ལྡན་པ་དེ་དག་ནི་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བར་སྣང་ལས་དོང་ངོ་། །
en: Knowing that Vajrapāṇi, Lord of the Guhyakas, had set out the midday meal, the Blessed One then spoke to the monks: “Since the Lord of the Guhyakas has set out the midday meal, monks, you should wear your monastic robes and take your alms bowls.

source: གང་དག་རྫུ་འཕྲུལ་དང་ལྡན་པ་མ་ཡིན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཁྲོད་དུ་ཞུགས་ནས་བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་ཏུ་ནམ་མཁའི་དཀྱིལ་གྱི་ལམ་ནས་དོང་ངོ་། །དེ་ནས་བཅོམ་ལྡན་འདས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལས་མི་སྣང་བར་གྱུར་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ནི་བསྐོར། ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱིས་ནི་མདུན་དུ་བདར།
en: Appoint a caretaker of the monastery and empower him with authority for seven days.” Those disciples and bodhisattvas who had superhuman powers then rose into the air by the power of their own superhuman powers, while those who did not have superhuman powers stood within the sphere of the Realized One’s aura of light and traveled through the vault of the sky with the Blessed One.

source: ལྷའི་ཚོགས་ཀྱིས་ནི་མངོན་པར་བསྟོད། ལྷའི་བུ་མོ་རྣམས་ནི་གླུ་དབྱངས་ལེན། འོད་ཟེར་ནི་འགྱེད། མེ་ཏོག་གི་ཆར་ནི་འབེབས། རོལ་མོ་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ནི་ལེན། ཞིང་རྣམས་ནི་གཡོ་བར་མཛད་ཅིང་། སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་དང་།
en: Then, surrounded by a host of bodhisattvas and at the head of a host of disciples, the Blessed One vanished from the hill, Vulture Peak, while a host of gods lauded him and a host of goddesses sung his praise, all of them radiating light, showering a rain of flowers, and playing millions upon billions of musical instruments as they made domains tremble.
